<h1>Задание 1</h1>
<?php
    $x =25; //присвоили х знач. 25
    while($x<10) //проверям 25 меньше 10. нам возвращается fasle
    {
        $x--;
    }
    echo($x); //выводим 25
?>

<h1>Задание 2</h1>

<?php
    echo (int) ((0.1 + 0.7) * 10); //7, результат внутреннего представления будет чем-то вроде 7.9999999999999991118....
?>

<h1>Задание 3</h1>
<?php
      switch(1) {
      case 1: print("Книга"); 
      case 2: print("Автор"); 
      default: print("Книга не найдена"); //КнигаАвторКнига не найдена - так как не стоят break после print
      }
?>

<h1>Задание 4</h1>
<?php
    $s = 2;
    switch ($s) {
      case 1:
         print("Валера");
         break;
      case 2:
         print("Павлик");
      case 3:
         print("youtube");
      default: print("По умолчанию"); //ПавликyoutubeПо умолчанию - нету break;
    }
?>

<h1>Задание 5</h1>
<?php
    $x=10;  //x = 10
    $b=++$x; //увеличили х на 1 и получили 11
    echo($b); // вывели 11
?>

<h1>Задание 6</h1>
<?php
     echo 0x33, ' птиц сидело на ', 022, ' деревьях.'; //51 птиц сидело на 18 деревьях. -- 0x33 - это число записано в 16-ричной системе и равно 51, а 022 - 18 в 8-ричной системе 
?>

<h1>Задание 7</h1>
<?php
for($a=1;$a<=100;$a++)
{
    if($a==50)
    {
        continue;//пропускаем 50
    }
    echo($a . PHP_EOL); // 1, 2, 3, ..., 49, 51, ..., 100
}
?>

<h1>Задание 8</h1>
<?php
   2a = 'Привет';
   echo $2a;    // ошибка, переменная не может начинатся с цифры
?>

<h1>Задание 9</h1>
<?php
    echo (int) "1235Валера"; //1235 берет только числа
?>

<h1>Задание 10</h1>
<?php
    echo (int) "Валера 1235"; //0. когда есть буквы, то пхп возрващает false - 0
?>

<h1>Задание 11</h1>
<?php
$x=10;
$y=5;
$x+=$y; // x = y + x = 10 + 5 = 15
var_dump($x, $y); // int(15) int(5) - x уже будет 15, а у = 5 мы его не изменяли
?>

<h1>Задание 12</h1>
<?php
   10 = $a;//нельзя так писать
    echo $a; // ошибка
?>

<h1>Задание 13</h1>
<?php

  $a = 1;
  $b = 10;
  $a++; // 2
  $a++; // 3
  $b = &$a; // b=3
  $a++; // 4
  $b--; // 3
  echo $b;  // 3
?>

<h1>Задание 14</h1>
<?php 
  $a = 'Апельсин';
  $b = 'Банан';
  echo 'Фрукт: ' . @$d; //'Фрукт: ' у нас нет переменной $d, а @ - перехват ошибки
?>
